{
  "products": [
    {
      "image": "https://example.com/images/cricket_bat.jpg",
      "itemName": "Premium Cricket Bat",
      "category": "Cricket",
      "description": "This premium cricket bat is crafted from the finest Grade A English willow, renowned for its lightweight feel and superior power. Handcrafted for professional performance, it ensures enhanced shot precision and control. The carefully pressed blade provides an excellent sweet spot for impactful strokes while maintaining durability and longevity. Ideal for both competitive matches and practice, this bat is perfect for players seeking optimal performance on the field.",
      "price": "150.00",
      "rating": 4.8,
      "customization": "Extra grip available with optional hit paper for enhanced control.",
      "processingTime": "5-7 Business Days",
      "stockStatus": 25
    },
    {
      "image": "https://example.com/images/cricket_gloves.jpg",
      "itemName": "Pro Cricket Gloves",
      "category": "Cricket",
      "description": "The Pro Cricket Gloves are designed to offer maximum protection and comfort for players at all levels. Constructed with premium padding and shock-absorbing foam, they ensure hand safety while providing a snug fit. The gloves feature an ergonomic design for enhanced flexibility, allowing players to maintain superior grip and control over the bat. Breathable materials ensure ventilation to keep hands dry during long matches.",
      "price": "50.00",
      "rating": 4.6,
      "customization": "Available in multiple sizes and colors to suit different player preferences.",
      "processingTime": "3-5 Business Days",
      "stockStatus": 30
    },
    {
      "image": "https://example.com/images/football.jpg",
      "itemName": "Official Match Football",
      "category": "Football",
      "description": "This official match football is FIFA-approved, making it suitable for professional and recreational use. Constructed with advanced materials for enhanced durability and flight stability, it provides consistent performance across all playing conditions. The carefully designed panels and superior stitching ensure reduced water absorption and improved aerodynamics for precise ball movement. Perfect for competitive matches and practice sessions alike.",
      "price": "50.00",
      "rating": 4.5,
      "customization": "Custom logo or personalized name print available for a unique touch.",
      "processingTime": "3-5 Business Days",
      "stockStatus": 40
    },
    {
      "image": "https://example.com/images/football_boots.jpg",
      "itemName": "Football Boots",
      "category": "Football",
      "description": "These high-performance football boots are engineered for speed, agility, and comfort. Featuring a lightweight yet durable design, they provide exceptional grip on all types of pitches. The boots are crafted with breathable materials and cushioned insoles, ensuring prolonged comfort during extended gameplay. Their ergonomic fit supports rapid movements while the stud configuration offers maximum traction and stability on the field.",
      "price": "120.00",
      "rating": 4.7,
      "customization": "Custom colors and player initials available for a personalized look.",
      "processingTime": "4-6 Business Days",
      "stockStatus": 20
    },
    {
      "image": "https://example.com/images/hockey_stick.jpg",
      "itemName": "Pro Hockey Stick",
      "category": "Hockey",
      "description": "This Pro Hockey Stick is expertly crafted for advanced gameplay, offering precision control and lightweight handling. Made from high-quality composite materials, it provides excellent power transfer while maintaining a balanced feel. The stick's textured grip enhances handling, making it perfect for competitive matches. Whether you're a professional or a dedicated amateur, this stick delivers outstanding performance.",
      "price": "110.00",
      "rating": 4.8,
      "customization": "Custom grip or player name engraving available for a unique playing experience.",
      "processingTime": "5-7 Business Days",
      "stockStatus": 15
    },
    {
      "image": "https://example.com/images/hockey_gloves.jpg",
      "itemName": "Hockey Gloves",
      "category": "Hockey",
      "description": "The Hockey Gloves offer a perfect blend of protection, flexibility, and comfort. Built with impact-resistant padding and reinforced stitching, they provide superior hand protection against high-speed impacts. The gloves' ergonomic design ensures a secure fit while allowing full finger movement for enhanced stick handling. Moisture-wicking fabric keeps hands dry, ensuring comfort during intense matches.",
      "price": "45.00",
      "rating": 4.7,
      "customization": "Available in multiple sizes and colors to match team aesthetics.",
      "processingTime": "2-4 Business Days",
      "stockStatus": 25
    },
    {
      "image": "https://example.com/images/tennis_racket.jpg",
      "itemName": "Pro Tennis Racket",
      "category": "Tennis",
      "description": "The Pro Tennis Racket is designed for high-performance play, combining a lightweight frame with advanced string technology. Crafted for professionals and enthusiasts, it provides superior control, power, and spin. The racket's durable construction minimizes vibration, offering a comfortable grip for extended play. Perfect for training, competitions, and casual games, this racket balances durability with top-tier performance.",
      "price": "120.00",
      "rating": 4.7,
      "customization": "Grip size or string tension adjustments available for personalized play.",
      "processingTime": "4-6 Business Days",
      "stockStatus": 15
    },
    {
      "image": "https://example.com/images/tennis_bag.jpg",
      "itemName": "Tennis Kit Bag",
      "category": "Tennis",
      "description": "This spacious Tennis Kit Bag is designed for optimal storage and organization. Made from durable materials, it accommodates multiple rackets, balls, and accessories while keeping them protected. The bag features multiple compartments and padded straps for comfortable carrying. Whether you're traveling for a match or practicing, this bag ensures all your gear stays secure and accessible.",
      "price": "60.00",
      "rating": 4.5,
      "customization": "Custom logo or player name print available to personalize your gear.",
      "processingTime": "3-5 Business Days",
      "stockStatus": 20
    },
    {
      "image": "https://example.com/images/hockey_helmet.jpg",
      "itemName": "Hockey Helmet",
      "category": "Hockey",
      "description": "The Hockey Helmet is engineered for maximum protection and comfort. Featuring advanced safety technology and adjustable fit mechanisms, it ensures superior impact resistance while allowing customization for individual players. The helmet is designed with breathable padding and ventilation channels to maintain airflow during gameplay, keeping you comfortable while staying protected.",
      "price": "80.00",
      "rating": 4.6,
      "customization": "Custom colors and team logo print available for a personalized look.",
      "processingTime": "5-7 Business Days",
      "stockStatus": 10
    }
  ]
}
